package com.vnovohatskyy.tasks.mathTasks;

public class mathTask01 {
    public static void main(String[] args) {

        // Создайте программу, которая вычислит выражение 20ˣ⅓+158² и выведет результат на экран.
        System.out.println(20.0/3+Math.pow(158,2));
    }
}
